---
type: Concrete
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 9
tags: [revit-api, class]
---

# Concrete

`Autodesk.Revit.DB.Visual.Concrete` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | CommonTintColor | 2018.1 | `public static string CommonTintColor { get ; }` |
| Property | CommonTintToggle | 2018.1 | `public static string CommonTintToggle { get ; }` |
| Property | ConcreteBmMap | 2018.1 | `public static string ConcreteBmMap { get ; }` |
| Property | ConcreteBrightmode | 2018.1 | `public static string ConcreteBrightmode { get ; }` |
| Property | ConcreteBumpAmount | 2018.1 | `public static string ConcreteBumpAmount { get ; }` |
| Property | ConcreteBumpMap | 2018.1 | `public static string ConcreteBumpMap { get ; }` |
| Property | ConcreteColor | 2018.1 | `public static string ConcreteColor { get ; }` |
| Property | ConcreteFinish | 2018.1 | `public static string ConcreteFinish { get ; }` |
| Property | ConcreteSealant | 2018.1 | `public static string ConcreteSealant { get ; }` |